GopalSaraf/Practicals/PSDL/include/proc/pic18f83j90.inc
// Register: LCDDATA20
#define LCDDATA20 LCDDATA20
LCDDATA20                                equ 0F7Ah
// bitfield definitions
LCDDATA20_LCDDATA20_POSN                 equ 0000h
LCDDATA20_LCDDATA20_POSITION             equ 0000h
LCDDATA20_LCDDATA20_SIZE                 equ 0008h
LCDDATA20_LCDDATA20_LENGTH               equ 0008h
LCDDATA20_LCDDATA20_MASK                 equ 00FFh
LCDDATA20_S16C3_POSN                     equ 0000h
LCDDATA20_S16C3_POSITION                 equ 0000h
LCDDATA20_S16C3_SIZE                     equ 0001h
LCDDATA20_S16C3_LENGTH                   equ 0001h
LCDDATA20_S16C3_MASK                     equ 0001h
LCDDATA20_S17C3_POSN                     equ 0001h
LCDDATA20_S17C3_POSITION                 equ 0001h
LCDDATA20_S17C3_SIZE                     equ 0001h
LCDDATA20_S17C3_LENGTH                   equ 0001h
LCDDATA20_S17C3_MASK                     equ 0002h
LCDDATA20_S18C3_POSN                     equ 0002h
LCDDATA20_S18C3_POSITION                 equ 0002h
LCDDATA20_S18C3_SIZE                     equ 0001h
LCDDATA20_S18C3_LENGTH                   equ 0001h
LCDDATA20_S18C3_MASK                     equ 0004h
LCDDATA20_S19C3_POSN                     equ 0003h
LCDDATA20_S19C3_POSITION                 equ 0003h
LCDDATA20_S19C3_SIZE                     equ 0001h
LCDDATA20_S19C3_LENGTH                   equ 0001h
LCDDATA20_S19C3_MASK                     equ 0008h
LCDDATA20_S20C3_POSN                     equ 0004h
LCDDATA20_S20C3_POSITION                 equ 0004h
LCDDATA20_S20C3_SIZE                     equ 0001h
LCDDATA20_S20C3_LENGTH                   equ 0001h
LCDDATA20_S20C3_MASK                     equ 0010h
LCDDATA20_S21C3_POSN                     equ 0005h
LCDDATA20_S21C3_POSITION                 equ 0005h
LCDDATA20_S21C3_SIZE                     equ 0001h
LCDDATA20_S21C3_LENGTH                   equ 0001h
LCDDATA20_S21C3_MASK                     equ 0020h
LCDDATA20_S22C3_POSN                     equ 0006h
LCDDATA20_S22C3_POSITION                 equ 0006h
LCDDATA20_S22C3_SIZE                     equ 0001h
LCDDATA20_S22C3_LENGTH                   equ 0001h
LCDDATA20_S22C3_MASK                     equ 0040h
LCDDATA20_S23C3_POSN                     equ 0007h
LCDDATA20_S23C3_POSITION                 equ 0007h
LCDDATA20_S23C3_SIZE                     equ 0001h
LCDDATA20_S23C3_LENGTH                   equ 0001h
LCDDATA20_S23C3_MASK                     equ 0080h
LCDDATA20_SEG16COM3_POSN                 equ 0000h
LCDDATA20_SEG16COM3_POSITION             equ 0000h
LCDDATA20_SEG16COM3_SIZE                 equ 0001h
LCDDATA20_SEG16COM3_LENGTH               equ 0001h
LCDDATA20_SEG16COM3_MASK                 equ 0001h
LCDDATA20_SEG17COM3_POSN                 equ 0001h
LCDDATA20_SEG17COM3_POSITION             equ 0001h
LCDDATA20_SEG17COM3_SIZE                 equ 0001h
LCDDATA20_SEG17COM3_LENGTH               equ 0001h
LCDDATA20_SEG17COM3_MASK                 equ 0002h
LCDDATA20_SEG18COM3_POSN                 equ 0002h
LCDDATA20_SEG18COM3_POSITION             equ 0002h
LCDDATA20_SEG18COM3_SIZE                 equ 0001h
LCDDATA20_SEG18COM3_LENGTH               equ 0001h
LCDDATA20_SEG18COM3_MASK                 equ 0004h
LCDDATA20_SEG19COM3_POSN                 equ 0003h
LCDDATA20_SEG19COM3_POSITION             equ 0003h
LCDDATA20_SEG19COM3_SIZE                 equ 0001h
LCDDATA20_SEG19COM3_LENGTH               equ 0001h
LCDDATA20_SEG19COM3_MASK                 equ 0008h
LCDDATA20_SEG20COM3_POSN                 equ 0004h
LCDDATA20_SEG20COM3_POSITION             equ 0004h
LCDDATA20_SEG20COM3_SIZE                 equ 0001h
LCDDATA20_SEG20COM3_LENGTH               equ 0001h
LCDDATA20_SEG20COM3_MASK                 equ 0010h
LCDDATA20_SEG21COM3_POSN                 equ 0005h
LCDDATA20_SEG21COM3_POSITION             equ 0005h
LCDDATA20_SEG21COM3_SIZE                 equ 0001h
LCDDATA20_SEG21COM3_LENGTH               equ 0001h
LCDDATA20_SEG21COM3_MASK                 equ 0020h
LCDDATA20_SEG22COM3_POSN                 equ 0006h
LCDDATA20_SEG22COM3_POSITION             equ 0006h
LCDDATA20_SEG22COM3_SIZE                 equ 0001h
LCDDATA20_SEG22COM3_LENGTH               equ 0001h
LCDDATA20_SEG22COM3_MASK                 equ 0040h
LCDDATA20_SEG23COM3_POSN                 equ 0007h
LCDDATA20_SEG23COM3_POSITION             equ 0007h
LCDDATA20_SEG23COM3_SIZE                 equ 0001h
LCDDATA20_SEG23COM3_LENGTH               equ 0001h
LCDDATA20_SEG23COM3_MASK                 equ 0080h

// Register: LCDDATA21
#define LCDDATA21 LCDDATA21
LCDDATA21                                equ 0F7Bh
// bitfield definitions
LCDDATA21_LCDDATA21_POSN                 equ 0000h
LCDDATA21_LCDDATA21_POSITION             equ 0000h
LCDDATA21_LCDDATA21_SIZE                 equ 0008h
LCDDATA21_LCDDATA21_LENGTH               equ 0008h
LCDDATA21_LCDDATA21_MASK                 equ 00FFh
LCDDATA21_S24C3_POSN                     equ 0000h
LCDDATA21_S24C3_POSITION                 equ 0000h
LCDDATA21_S24C3_SIZE                     equ 0001h
LCDDATA21_S24C3_LENGTH                   equ 0001h
LCDDATA21_S24C3_MASK                     equ 0001h
LCDDATA21_S25C3_POSN                     equ 0001h
LCDDATA21_S25C3_POSITION                 equ 0001h
LCDDATA21_S25C3_SIZE                     equ 0001h
LCDDATA21_S25C3_LENGTH                   equ 0001h
LCDDATA21_S25C3_MASK                     equ 0002h
LCDDATA21_S26C3_POSN                     equ 0002h
LCDDATA21_S26C3_POSITION                 equ 0002h
LCDDATA21_S26C3_SIZE                     equ 0001h
LCDDATA21_S26C3_LENGTH                   equ 0001h
LCDDATA21_S26C3_MASK                     equ 0004h
LCDDATA21_S27C3_POSN                     equ 0003h
LCDDATA21_S27C3_POSITION                 equ 0003h
LCDDATA21_S27C3_SIZE                     equ 0001h
LCDDATA21_S27C3_LENGTH                   equ 0001h
LCDDATA21_S27C3_MASK                     equ 0008h
LCDDATA21_S28C3_POSN                     equ 0004h
LCDDATA21_S28C3_POSITION                 equ 0004h
LCDDATA21_S28C3_SIZE                     equ 0001h
LCDDATA21_S28C3_LENGTH                   equ 0001h
LCDDATA21_S28C3_MASK                     equ 0010h
LCDDATA21_S29C3_POSN                     equ 0005h
LCDDATA21_S29C3_POSITION                 equ 0005h
LCDDATA21_S29C3_SIZE                     equ 0001h
LCDDATA21_S29C3_LENGTH                   equ 0001h
LCDDATA21_S29C3_MASK                     equ 0020h
LCDDATA21_S30C3_POSN                     equ 0006h
LCDDATA21_S30C3_POSITION                 equ 0006h
LCDDATA21_S30C3_SIZE                     equ 0001h
LCDDATA21_S30C3_LENGTH                   equ 0001h
LCDDATA21_S30C3_MASK                     equ 0040h
LCDDATA21_S31C3_POSN                     equ 0007h
LCDDATA21_S31C3_POSITION                 equ 0007h
LCDDATA21_S31C3_SIZE                     equ 0001h
LCDDATA21_S31C3_LENGTH                   equ 0001h
LCDDATA21_S31C3_MASK                     equ 0080h
LCDDATA21_SEG24COM3_POSN                 equ 0000h
LCDDATA21_SEG24COM3_POSITION             equ 0000h
LCDDATA21_SEG24COM3_SIZE                 equ 0001h
LCDDATA21_SEG24COM3_LENGTH               equ 0001h
LCDDATA21_SEG24COM3_MASK                 equ 0001h
LCDDATA21_SEG25COM3_POSN                 equ 0001h
LCDDATA21_SEG25COM3_POSITION             equ 0001h
LCDDATA21_SEG25COM3_SIZE                 equ 0001h
LCDDATA21_SEG25COM3_LENGTH               equ 0001h
LCDDATA21_SEG25COM3_MASK                 equ 0002h
LCDDATA21_SEG26COM3_POSN                 equ 0002h
LCDDATA21_SEG26COM3_POSITION             equ 0002h
LCDDATA21_SEG26COM3_SIZE                 equ 0001h
LCDDATA21_SEG26COM3_LENGTH               equ 0001h
LCDDATA21_SEG26COM3_MASK                 equ 0004h
LCDDATA21_SEG27COM3_POSN                 equ 0003h
LCDDATA21_SEG27COM3_POSITION             equ 0003h
LCDDATA21_SEG27COM3_SIZE                 equ 0001h
LCDDATA21_SEG27COM3_LENGTH               equ 0001h
LCDDATA21_SEG27COM3_MASK                 equ 0008h
LCDDATA21_SEG28COM3_POSN                 equ 0004h
LCDDATA21_SEG28COM3_POSITION             equ 0004h
LCDDATA21_SEG28COM3_SIZE                 equ 0001h
LCDDATA21_SEG28COM3_LENGTH               equ 0001h
LCDDATA21_SEG28COM3_MASK                 equ 0010h
LCDDATA21_SEG29COM3_POSN                 equ 0005h
LCDDATA21_SEG29COM3_POSITION             equ 0005h
LCDDATA21_SEG29COM3_SIZE                 equ 0001h
LCDDATA21_SEG29COM3_LENGTH               equ 0001h
LCDDATA21_SEG29COM3_MASK                 equ 0020h
LCDDATA21_SEG30COM3_POSN                 equ 0006h
LCDDATA21_SEG30COM3_POSITION             equ 0006h
LCDDATA21_SEG30COM3_SIZE                 equ 0001h
LCDDATA21_SEG30COM3_LENGTH               equ 0001h
LCDDATA21_SEG30COM3_MASK                 equ 0040h
LCDDATA21_SEG31COM3_POSN                 equ 0007h
LCDDATA21_SEG31COM3_POSITION             equ 0007h
LCDDATA21_SEG31COM3_SIZE                 equ 0001h
LCDDATA21_SEG31COM3_LENGTH               equ 0001h
LCDDATA21_SEG31COM3_MASK                 equ 0080h

