GopalSaraf/Practicals/PSDL/include/proc/pic18f83j90.inc
// Register: SSPADD
#define SSPADD SSPADD
SSPADD                                   equ 0FC8h
// bitfield definitions
SSPADD_MSK0_POSN                         equ 0000h
SSPADD_MSK0_POSITION                     equ 0000h
SSPADD_MSK0_SIZE                         equ 0001h
SSPADD_MSK0_LENGTH                       equ 0001h
SSPADD_MSK0_MASK                         equ 0001h
SSPADD_MSK01_POSN                        equ 0000h
SSPADD_MSK01_POSITION                    equ 0000h
SSPADD_MSK01_SIZE                        equ 0001h
SSPADD_MSK01_LENGTH                      equ 0001h
SSPADD_MSK01_MASK                        equ 0001h
SSPADD_MSK1_POSN                         equ 0001h
SSPADD_MSK1_POSITION                     equ 0001h
SSPADD_MSK1_SIZE                         equ 0001h
SSPADD_MSK1_LENGTH                       equ 0001h
SSPADD_MSK1_MASK                         equ 0002h
SSPADD_MSK11_POSN                        equ 0001h
SSPADD_MSK11_POSITION                    equ 0001h
SSPADD_MSK11_SIZE                        equ 0001h
SSPADD_MSK11_LENGTH                      equ 0001h
SSPADD_MSK11_MASK                        equ 0002h
SSPADD_MSK2_POSN                         equ 0002h
SSPADD_MSK2_POSITION                     equ 0002h
SSPADD_MSK2_SIZE                         equ 0001h
SSPADD_MSK2_LENGTH                       equ 0001h
SSPADD_MSK2_MASK                         equ 0004h
SSPADD_MSK21_POSN                        equ 0002h
SSPADD_MSK21_POSITION                    equ 0002h
SSPADD_MSK21_SIZE                        equ 0001h
SSPADD_MSK21_LENGTH                      equ 0001h
SSPADD_MSK21_MASK                        equ 0004h
SSPADD_MSK3_POSN                         equ 0003h
SSPADD_MSK3_POSITION                     equ 0003h
SSPADD_MSK3_SIZE                         equ 0001h
SSPADD_MSK3_LENGTH                       equ 0001h
SSPADD_MSK3_MASK                         equ 0008h
SSPADD_MSK31_POSN                        equ 0003h
SSPADD_MSK31_POSITION                    equ 0003h
SSPADD_MSK31_SIZE                        equ 0001h
SSPADD_MSK31_LENGTH                      equ 0001h
SSPADD_MSK31_MASK                        equ 0008h
SSPADD_MSK4_POSN                         equ 0004h
SSPADD_MSK4_POSITION                     equ 0004h
SSPADD_MSK4_SIZE                         equ 0001h
SSPADD_MSK4_LENGTH                       equ 0001h
SSPADD_MSK4_MASK                         equ 0010h
SSPADD_MSK41_POSN                        equ 0004h
SSPADD_MSK41_POSITION                    equ 0004h
SSPADD_MSK41_SIZE                        equ 0001h
SSPADD_MSK41_LENGTH                      equ 0001h
SSPADD_MSK41_MASK                        equ 0010h
SSPADD_MSK5_POSN                         equ 0005h
SSPADD_MSK5_POSITION                     equ 0005h
SSPADD_MSK5_SIZE                         equ 0001h
SSPADD_MSK5_LENGTH                       equ 0001h
SSPADD_MSK5_MASK                         equ 0020h
SSPADD_MSK51_POSN                        equ 0005h
SSPADD_MSK51_POSITION                    equ 0005h
SSPADD_MSK51_SIZE                        equ 0001h
SSPADD_MSK51_LENGTH                      equ 0001h
SSPADD_MSK51_MASK                        equ 0020h
SSPADD_MSK6_POSN                         equ 0006h
SSPADD_MSK6_POSITION                     equ 0006h
SSPADD_MSK6_SIZE                         equ 0001h
SSPADD_MSK6_LENGTH                       equ 0001h
SSPADD_MSK6_MASK                         equ 0040h
SSPADD_MSK61_POSN                        equ 0006h
SSPADD_MSK61_POSITION                    equ 0006h
SSPADD_MSK61_SIZE                        equ 0001h
SSPADD_MSK61_LENGTH                      equ 0001h
SSPADD_MSK61_MASK                        equ 0040h
SSPADD_MSK7_POSN                         equ 0007h
SSPADD_MSK7_POSITION                     equ 0007h
SSPADD_MSK7_SIZE                         equ 0001h
SSPADD_MSK7_LENGTH                       equ 0001h
SSPADD_MSK7_MASK                         equ 0080h
SSPADD_MSK71_POSN                        equ 0007h
SSPADD_MSK71_POSITION                    equ 0007h
SSPADD_MSK71_SIZE                        equ 0001h
SSPADD_MSK71_LENGTH                      equ 0001h
SSPADD_MSK71_MASK                        equ 0080h

// Register: SSPBUF
#define SSPBUF SSPBUF
SSPBUF                                   equ 0FC9h

// Register: T2CON
#define T2CON T2CON
T2CON                                    equ 0FCAh
// bitfield definitions
T2CON_T2CKPS_POSN                        equ 0000h
T2CON_T2CKPS_POSITION                    equ 0000h
T2CON_T2CKPS_SIZE                        equ 0002h
T2CON_T2CKPS_LENGTH                      equ 0002h
T2CON_T2CKPS_MASK                        equ 0003h
T2CON_TMR2ON_POSN                        equ 0002h
T2CON_TMR2ON_POSITION                    equ 0002h
T2CON_TMR2ON_SIZE                        equ 0001h
T2CON_TMR2ON_LENGTH                      equ 0001h
T2CON_TMR2ON_MASK                        equ 0004h
T2CON_T2OUTPS_POSN                       equ 0003h
T2CON_T2OUTPS_POSITION                   equ 0003h
T2CON_T2OUTPS_SIZE                       equ 0004h
T2CON_T2OUTPS_LENGTH                     equ 0004h
T2CON_T2OUTPS_MASK                       equ 0078h
T2CON_T2CKPS0_POSN                       equ 0000h
T2CON_T2CKPS0_POSITION                   equ 0000h
T2CON_T2CKPS0_SIZE                       equ 0001h
T2CON_T2CKPS0_LENGTH                     equ 0001h
T2CON_T2CKPS0_MASK                       equ 0001h
T2CON_T2CKPS1_POSN                       equ 0001h
T2CON_T2CKPS1_POSITION                   equ 0001h
T2CON_T2CKPS1_SIZE                       equ 0001h
T2CON_T2CKPS1_LENGTH                     equ 0001h
T2CON_T2CKPS1_MASK                       equ 0002h
T2CON_T2OUTPS0_POSN                      equ 0003h
T2CON_T2OUTPS0_POSITION                  equ 0003h
T2CON_T2OUTPS0_SIZE                      equ 0001h
T2CON_T2OUTPS0_LENGTH                    equ 0001h
T2CON_T2OUTPS0_MASK                      equ 0008h
T2CON_T2OUTPS1_POSN                      equ 0004h
T2CON_T2OUTPS1_POSITION                  equ 0004h
T2CON_T2OUTPS1_SIZE                      equ 0001h
T2CON_T2OUTPS1_LENGTH                    equ 0001h
T2CON_T2OUTPS1_MASK                      equ 0010h
T2CON_T2OUTPS2_POSN                      equ 0005h
T2CON_T2OUTPS2_POSITION                  equ 0005h
T2CON_T2OUTPS2_SIZE                      equ 0001h
T2CON_T2OUTPS2_LENGTH                    equ 0001h
T2CON_T2OUTPS2_MASK                      equ 0020h
T2CON_T2OUTPS3_POSN                      equ 0006h
T2CON_T2OUTPS3_POSITION                  equ 0006h
T2CON_T2OUTPS3_SIZE                      equ 0001h
T2CON_T2OUTPS3_LENGTH                    equ 0001h
T2CON_T2OUTPS3_MASK                      equ 0040h

// Register: PR2
#define PR2 PR2
PR2                                      equ 0FCBh
// bitfield definitions
PR2_EBDIS_POSN                           equ 0007h
PR2_EBDIS_POSITION                       equ 0007h
PR2_EBDIS_SIZE                           equ 0001h
PR2_EBDIS_LENGTH                         equ 0001h
PR2_EBDIS_MASK                           equ 0080h
PR2_WAIT0_POSN                           equ 0004h
PR2_WAIT0_POSITION                       equ 0004h
PR2_WAIT0_SIZE                           equ 0001h
PR2_WAIT0_LENGTH                         equ 0001h
PR2_WAIT0_MASK                           equ 0010h
PR2_WAIT1_POSN                           equ 0005h
PR2_WAIT1_POSITION                       equ 0005h
PR2_WAIT1_SIZE                           equ 0001h
PR2_WAIT1_LENGTH                         equ 0001h
PR2_WAIT1_MASK                           equ 0020h
PR2_WM0_POSN                             equ 0000h
PR2_WM0_POSITION                         equ 0000h
PR2_WM0_SIZE                             equ 0001h
PR2_WM0_LENGTH                           equ 0001h
PR2_WM0_MASK                             equ 0001h
PR2_WM1_POSN                             equ 0001h
PR2_WM1_POSITION                         equ 0001h
PR2_WM1_SIZE                             equ 0001h
PR2_WM1_LENGTH                           equ 0001h
PR2_WM1_MASK                             equ 0002h

